---
kind: enumMember
id: F:Autodesk.Revit.UI.Selection.ObjectType.Subelement
enum: Autodesk.Revit.UI.Selection.ObjectType
source: html/2d0cbbba-d4ab-84b7-b081-36c14769d82c.htm
---
# Autodesk.Revit.UI.Selection.ObjectType.Subelement

Whole element or subelement.